Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: Aquest fitxer pot contenir, a més del text mateix, informació sobre la presentació: el format dels paràgrafs i de les pàgines, sobre els tipus i les grandàries de lletra que s'usen amb cada mot, etc., o sobre l'organització del contingut (indicacions que una determinada part del text és un títol de capítol, o una nota a peu de pàgina, etc.).
es_es: Este fichero puede contener, además del texto mismo, información sobre la presentación: el formato de los párrafos y de las páginas, sobre los tipos y los tamaños de letra que se usan con cada palabra, etc., o sobre la organización del contenido (indicaciones que indican si es una determinada parte del texto es un título de capítulo, o una nota a pie de página, etc.).

source: Com ja s'ha dit més amunt, una operació molt important per a la reutilització o el reciclatge de traduccions antigues és la d'alinear els textos i les traduccions existents per a identificar fragments o unitats de traducció que es puguen reutilitzar posteriorment.
es_es: Cómo ya se ha dicho antes, una operación muy importante para la reutilización o el reciclaje de traducciones antiguas es la de alinear los textos y las traducciones existentes para identificar fragmentos o unidades de traducción que se puedan reutilizar posteriormente

source: text dret $D$
es_es: texto de la derecha $D$

source: La longitud de les unitats de traducció pot anar des dels mots fins a les oracions senceres.
es_es: La longitud de las unidades de traducción puede ir desde las palabras hasta las oraciones enteras.

source: Però, com que això succeix poques vegades, ja que és difícil que una oració es repetisca exactament, la major part dels sistemes comercials usen estratègies per a no desaprofitar unitats de traducció que continguen oracions similars a la nova: Alguns programes, si no troben una UT que té la part esquerra idèntica a l'observada en el nou text ($e'$), però troben una, $(e,d)$, la part esquerra $e$ de la qual es diferencia en un mot o en un cert percentatge dels mots de $e'$, presenten com a traducció aproximada la part dreta ($d$) corresponent a $e$.
es_es: Pero, como que esto sucede pocas veces, puesto que es difícil que una oración se repita exactamente, la mayor parte de los sistemas comerciales usan estrategias para no desaprovechar unidades de traducción que contengan oraciones similares a la nueva: Algunos programas, si no encuentran una UT que tiene la parte izquierda idéntica en la observada en el nuevo texto ($i'$), pero encuentran una, $(i,d)$, la parte izquierda $i$ de la cual se diferencia en una palabra o en un cierto porcentaje de las palabras de $i'$, presentan como traducción aproximada la parte derecha ($d$) correspondiendo a $i$.

source: Solució: Si detectem [xifra] ``.'' [xifra] (sense blancs), no segmentem.
es_es: Solución: Si detectamos [cifra] ``.'' [cifra] (sin blancos), no segmentamos.

source: O obtingut mitjançant mètodes estadístics con els descrits en l'apartat .
es_es: U obtenido mediante métodos estadísticos con los descritos en el apartado .

source: {Alineament de bitextos.
es_es: {Alineamiento de bitextos.

source: text dret pretraduït i segmentat
es_es: texto de la derecha pretraducido y segmentado

source: Segmentar cada un dels dos textos en oracions.
es_es: Segmentar cada uno de los dos textos en oraciones.

source: Vol dir això que no podran compartir les memòries de traducció que hagen anat construint?
es_es: ¿Quiere decir esto que no podrán compartir las memorias de traducción que hayan ido construyendo?

source: Les memòries de traducció són bàsicament sistemes de traducció directa i, per tant, la unitat bàsica de traducció que usen és el mot.
es_es: Las memorias de traducción son básicamente sistemas de traducción directa y, por lo tanto, la unidad básica de traducción que usan es la palabra.

source: {Correcció de la pretraducció.
es_es: {Corrección de la pretraducción.

source: Als sistemes de traducció automàtica per interlingua.
es_es: A los sistemas de traducción automática por interlingua.

source: Com ja hem vist en l'apartat , els bits van normalment en grups de vuit (bytes o octets).
es_es: Cómo ya hemos visto en la apartado , los bits<\/y0> van normalmente en grupos de ocho (bytes<\/y1> o octetos<\/y2>).

source: Normalment, els sistemes, quan troben un fragment similar però no idèntic, destaquen gràficament les diferències (per exemple, amb colors); així, la persona usuària pot fer-hi les modificacions necessària perquè la traducció resultant siga correcta; alguns sistemes, fins i tot, són capaços d'usar les bases de dades lèxiques o terminològiques de la persona usuària per a proposar traduccions per als mots discordants.
es_es: Normalmente, los sistemas, cuando encuentran un fragmento similar pero no idéntico, destacan gráficamente las diferencias (por ejemplo, con colores); así, la persona usuaria puede hacer las modificaciones necesaria porque la traducción resultante sea correcta; algunos sistemas, incluso, son capaces de usar las bases de datos léxicas o terminológicas de la persona usuaria para proponer traducciones para las palabras *discordants.

source: Solució: si detectem [majúscules] ``.'' [majúscules] ``.'', no segmentar.
es_es: Solución: si detectamos [mayúsculas] ``.'' [mayúsculas] ``.'', no segmentar.

source: Unitats de traducció}
es_es: Unidades de traducción}

source: text dret corregit $$ {Esquema del procés de correcció del text pretraduït i actualització de la memòria de traducció.}
es_es: text dret corregit $$ {Esquema del proceso de corrección del texto pretraducido y actualitzación de la memoria de traducción.}

source: $$ bitext{rcl} text esquerre $E$
es_es: $$ bitexto{rcl} texto de la izquierda $I$

source: D'altres programes usen estratègies pròpies (no descrites) per a ``assemblar'' o ``construir'' traduccions usant fragments de parts dretes de més d'una UT.
es_es: Otros programas usan estrategias propias (no descritas) para ``asemejar'' o ``construir'' traducciones usando fragmentos de partes derechas de más de una UT.

source: Formats de text
es_es: Formados de texto

source: Punts en URIs i adreces de correu electrònic.
es_es: Puntos en URIs y direcciones de correo electrónico.

source: Punts al final d'abreviatura de cortesia: Sr(.), Dra(.), Excm(.), etc.
es_es: Puntos al final de abreviatura de cortesía: Sr(.), Dra(.), Excm(.), etc.

source: Les memòries de traducció usen informació sobre les categories lèxiques dels mots per a decidir els alineaments.
es_es: Las memorias de traducción usan información sobre las categorías léxicas de las palabras para decidir los alineamientos.

source: Freqüentment, els traductors formen equips que col·laboren a l'hora de produir les traduccions; quan usen memòries de traducció, és possible que hi haja traductors que preferisquen un programa i uns altres que en preferisquen un altre.
es_es: Frecuentemente, los traductores forman equipos que colaboran a la hora de producir las traducciones; cuando usan memorias de traducción, es posible que haya traductores que prefieran un programa y otros que prefieran otro.

source: {} aproximadament equivalents a una oració, usant regles senzilles i relativament independents de la llengua per a segmentar (dividir) cada text en oracions.
es_es: {} aproximadamente equivalentes a una oración, usando reglas sencillas y relativamente independientes de la lengua para segmentar (dividir) cada texto en oraciones.

source: La majoria dels programes de memòria de traducció ofereixen a la persona usuària la possibilitat de validar o modificar (usant una representació gràfica, comandes senzilles i el ratolí, per a unir o dividir fragments en el text esquerre o en el text dret) l'alineament automàtic inicial usant una interfície senzilla i intuïtiva, abans d'incorporar els fragments resultants a la memòria de traducció.
es_es: La mayoría de los programas de memoria de traducción ofrecen a la persona usuaria la posibilidad de validar o modificar (usando una representación gráfica, pedidos sencillos y el ratón, para unir o dividir fragmentos en el texto izquierdo o en el texto derecho) el alineamiento automático inicial usando una interfaz sencilla e intuitiva, antes de incorporar los fragmentos resultantes a la memoria de traducción.

source: Solucions
es_es: Soluciones

source: Ha de quedar clar que, per a poder fer-ho, els textos originals i les traduccions han d'estar en format informatitzat (fitxers de text).
es_es: Tiene que quedar claro que, para poder hacerlo, los textos originales y las traducciones tienen que estar en formato informatizado (ficheros de texto).

source: Un text informatitzat pot tenir orígens diversos: Pot haver estat generat per un altre programa d'ordinador, per exemple a partir de les dades contingudes en alguna base de dades (vegeu la pàg. ).
es_es: Un texto informatizado puede tener diversos orígenes: Puede haber sido generado por otro programa de ordenador, por ejemplo a partir de los datos contenidos en alguna base de datos (veáis la pág. ).

source: Indica quina d'aquestes afirmacions és certa.
es_es: Indica cual de estas afirmaciones es correcta.

source: El podem haver descarregat (copiat) d'algun servidor d'Internet (vegeu la pàg. ).
es_es: Lo podemos haber descargado (copiado) de algún servidor de Internet (ver pág. ).

source: Qüestions i exercicis
es_es: Preguntas y ejercicios

source: {{1.6cm{alineador- corrector assistit}}} {l} UTs {{2.1cm{Memòria de traducció}}}
es_es: {{1.6cm{alineador- corrector assistido}}} {l} UTs {{2.1cm{Memoria de traducción}}}

source: Després van anar [...] [...] per CC.OO.
es_es: Después fueron [...] [...] por CC.OO.

source: La repetitivitat La similitud entre les llengües origen i meta
es_es: La repetitivitat La similitud entre las lenguas origen y meta

source: {{2.1cm{Memòria de traducció}}}
es_es: {{2.1cm{Memoria de traducción}}}

source: El podem haver rebut annex a un missatge electrònic (vegeu la pàg. ).
es_es: Lo podemos haber recibido anexo a un mensaje electrónico (ver pág. ).

source: $$ {rcl} text esquerre $E'$ {segmentació}
es_es: $$ {rcl} texto de la izquierda $I'$ {segmentación}

source: Word met fin à la session en cours.</seg> </tuv> </tu> <tu tuid='512'> <prop type='tmkey'>a thumbnail preview is not available for this file</prop> <tuv xml:lang='EN-US'> <seg>A thumbnail preview is not available for this file.</seg> </tuv> <tuv xml:lang='FR-FR'> <seg>Il n'y a pas d'aperçu disponible pour cette image.</seg> </tuv> </tu> <!-- ... --> </body> </tmx> En l'exemple, les unitats de traducció (tu) del cos (body), cada una amb el seu identificador únic (tuid) contenen dues variants (tuv), cada una en una llengua (xml:lang=""), a més d'un element prop que conté la clau (key) per a cercar la UT en la base de dades.
es_es: Word met fin à la session en cours.</seg> </tuv> </tu> <tu tuid='512'> <prop type='tmkey'>a thumbnail preview is not available for this file</prop> <tuv xml:lang='EN-US'> <seg>A thumbnail preview is not available for this file.</seg> </tuv> <tuv xml:lang='FR-FR'> <seg>Il n'y a pas d'aperçu disponible pour cette image.</seg> </tuv> </tu> <!-- ... --> </body> </tmx> En el ejemplo , las unidades de traducción (tu) del cuerpo (body),cada una con su identificador único (tuid) contenen dos variantes (tuv), cada un en una lengua (xml:lang=""), además de un elemento prop que contiene la clave (key) para buscar la UT en la base de datos.

source: Documents de text
es_es: Documentos de texto

source: Heus ací part d'una memòria de traducció en TMX (s'hi mostren només dues UTs): <?xml version='1.0' encoding='ISO-8859-1' ?> <!DOCTYPE tmx SYSTEM 'tmx13.dtd'> <tmx version='1.3'> <header creationtool='Waikoloa' creationtoolversion='1.00' datatype='plaintext' segtype='paragraph' adminlang='EN-US' srclang='EN-US' o-tmf='okLiteTM' > </header> <body> <!-- ... --> <tu tuid='511'> <prop type='tmkey'>a thesaurus error occurred word is ending the current session</prop> <tuv xml:lang='EN-US'> <seg>A thesaurus error occurred.
es_es: He aquí parte de una memoria de traducción en TMX (se muestran sólo dos UTs): <?xml version='1.0' encoding='ISO-8859-1' ?> <!DOCTYPE tmx SYSTEM 'tmx13.dtd'> <tmx version='1.3'> <*header *creationtool='Waikoloa' creationtoolversion='1.00' datatype='plaintext' segtype='paragraph' adminlang='-OS' srclang='EN-OS' o-tmf='okLiteTM' > <\/header> <body> <!-- ... --> <tu tuid='511'> <cerca type='tmkey'>a thesaurus error occurred word is ending the current session<\/cerca> <tuv xml:lang='-OS'> <seg>A thesaurus error occurred.

source: {} equivalents a una oració, usant una anàlisi lingüística detallada del text per a determinar l'extensió de cada oració.
es_es: {} equivalentes a una oración, usando un análisis lingüístico detallado del texto para determinar la extensión de cada oración.

source: És possible que els dos textos no tinguen el mateix nombre d'``oracions'' o que l'estratègia per a fragmentar-los falle per alguna causa i l'alineament no siga perfecte.
es_es: Es posible que los dos textos no tengan el mismo número de ``oraciones'' o que la estrategia para fragmentarlos falle por alguna causa y el alineamiento no sea perfecto.

source: Això s'anomena alineament.
es_es: Esto se denomina alineamiento.

source: Quina és la millor manera de dividir-lo en unitats de traducció?
es_es: ¿Cual es la mejor manera de dividirlo en unidades de traducción?

source: Aquest codi assigna un número de 7 bits a cada caràcter, de manera que permet emmagatzemar un caràcter per octet i encara en sobra un bit.
es_es: Este código asigna un número de 7 bits a cada carácter, de forma que permite almacenar un carácter por octeto y todavía sobra un bit.

source: Aquests programes són molt populars entre les persones que es dediquen professionalment a la traducció, molt més populars que els programes de traducció automàtica.
es_es: Estos programas son muy populares entre las personas que se dedican profesionalmente a la traducción, mucho más populares que los programas de traducción automática.

source: Ampliació de la memòria}
es_es: Ampliación de la memoria}

source: Per això, necessitem segmentar o dividir els bitextos que tenim en bitextos més menuts, amb parts esquerres que tinguen possibilitats de aparéixer de nou.
es_es: Por eso, necesitamos segmentar o dividir los bitextos que tenemos en bitextos más pequeños, con partes izquierdas que tengan posibilidades de aparecer de nuevo.

source: Per tant, els fragments obtinguts no són en general els ideals.
es_es: Por lo tanto, los fragmentos obtenidos no son en general los ideales.

source: En aquests casos, la comparació de versions diferents del que és essencialment el mateix text i la traducció repetitiva de textos similars és innecessàriament laboriosa.
es_es: En estos casos, la comparación de versiones diferentes del que es esencialmente el mismo texto y la traducción repetitiva de textos similares es innecesariamente laboriosa.

source: La majoria de les memòries de traducció comercials divideixen els bitextos en unitats de traducció{}
es_es: La mayoría de las memorias de traducción comerciales dividen los bitextos en unidades de traducción{}

source: En l'actualitat, hi ha molts programes de memòria de traducció de propòsit general disponibles comercialment (SDL Trados de SDL International, Déjà Vu d'Atril, IBM Translation Manager, Transit de Star, etc., per nomenar algunes de les més conegudes).
es_es: En la actualidad, hay muchos programas de memoria de traducción de propósito general disponibles comercialmente (SDL Trados de SDL International, *Déjà *Vu de Atril, IBM Translation Manager, *Transit de Star, etc., para nombrar algunas de las más conocidas).

source: L'alineament automàtic de textos traduïts no és una tasca senzilla; són necessaris coneixements previs sobre les llengües involucrades (per exemple, correspondències entre mots o alineaments prèviament validats per una persona experta); per això, la majoria dels sistemes de memòria de traducció usen mecanismes molt senzills per a segmentar els textos, tant per a alinear bitextos com per a dividir un text esquerre nou en fragments per a cercar-los en la base de dades.
es_es: El alineamiento automático de textos traducidos no es una tarea sencilla; son necesarios conocimientos previos sobre las lenguas involucradas (por ejemplo, correspondencias entre palabras o alineamientos previamente validados por una persona experta); por eso, la mayoría de los sistemas de memoria de traducción usan mecanismos muy sencillos para segmentar los textos, tanto para alinear bitextos cómo para dividir un texto izquierdo nuevo en fragmentos para buscarlos en la base de datos.

source: Les memòries de traducció organitzen els fragments i les traduccions corresponents en bases de dades similars a les bases de dades lèxiques o terminològiques.
es_es: Las memorias de traducción organizan los fragmentos y las traducciones correspondientes en bases de datos similares a las bases de datos léxicas o terminológicas.

source: El resultat de segmentar el text nou i substituir els segments que s'han trobat en la memòria de traducció pels equivalents drets corresponents s'anomena pretraducció i es mostra en la figura .
es_es: El resultado de segmentar el texto nuevo y sustituir los segmentos que se han encontrado en la memoria de traducción por los equivalentes derechos correspondientes se denomina pretraducción y se muestra en la figura .

source: Productes
es_es: Productos

source: El format TMX segueix les especificacions XML (vegeu l'apartat ); és a dir, les memòries TMX són un tipus de document XML, definit, per tant, per una DTD concreta..}
es_es: El formato TMX sigue las especificaciones XML (ver la apartado ); es decir, las memorias TMX son un tipo de documento XML, definido, por lo tanto, por una DTD concreta..}

source: L'entrada i el processament de textos
es_es: La entrada y el procesamiento de textos

source: És a dir, per una banda, es dóna un compromís entre la cobertura (fracció d'un text nou que podria ser traduït usant els fragments alineats) i la precisió (correcció de les traduccions resultants).
es_es: Es decir, por un lado, se da un compromiso entre la cobertura (fracción de un texto nuevo que podría ser traducido usando los fragmentos alineados) y la precisión (corrección de las traducciones resultantes).

source: {{1.25cm{segmen- tació}}}
es_es: {1.25cm{segmen- tación}}}

source: Als sistemes de traducció automàtica per transferència.
es_es: A los sistemas de traducción automática por transferencia.

source: L'organització de les UT en una base de dades permet, a més, recuperar de la memòria de traducció, quan s'està traduint un text nou, els fragments més adequats i construir amb ells la traducció.
es_es: La organización de las UT en una base de datos permite, además, recuperar de la memoria de traducción, cuando se está traduciendo un texto nuevo, los fragmentos más adecuados y construir con ellos la traducción.

source: Per exemple, en el cas de l'espanyol i el català, una gran memòria de traducció alimentada amb les traduccions fetes només en l'àmbit de les administracions autonòmiques i locals estalviaria grans quantitats de temps i diners a l'hora de mantenir la documentació bilingüe d'aquestes institucions, però encara no s'ha substanciat un recurs d'aquesta mena, malgrat la gran quantitat de veus que n'han expressat la necessitat i la conveniència.
es_es: Por ejemplo, en el caso del español y el catalán, una gran memoria de traducción alimentada con las traducciones hechas sólo en el ámbito de las administraciones autonómicas y locales ahorraría grandes cantidades de tiempo y dinero a la hora de mantener la documentación bilingüe de estas instituciones, pero todavía no se ha sustanciado un recurso de este tipo, a pesar de la gran cantidad de voces que han expresado la necesidad y la conveniencia.

source: L'intercanvi de memòries de traducció
es_es: El intercambio de memorias de traducción

source: El bitext de més amunt es podria alinear per a formar les unitats de traducció {"Tenemos"}{"Tenim"}
es_es: El bitexto que esté posicionado más arriba se podría alinear para formar las unidades de traducción {"Tenemos"}{"Tenim"}

source: {La memòria de traducció com a base de dades}
es_es: {La memoria de traducción como base de datos}

source: Punts suspensius (``...'').
es_es: Puntos suspensivos (``...'').

source: {2cm{text dret pretraduït i segmentat}}
es_es: {2cm{texto de la derecha pretraducido y segmentado}}

source: El procés s'esquematitza en la figura ; la repetició del cicle pretraducció--correcció--enviament de noves UT a la memòria enriqueix la memòria de traducció i permet obtenir cada vegada pretraduccions més completes i correctes.
es_es: El proceso se esquematiza en la figura ; la repetición del ciclo pretraducción--corrección--envío de nuevas UT a la memoria enriquece la memoria de traducción y permite obtener cada vez pretraducciones más completas y correctas.

source: Però si el fragment és massa menut és més probable que la traducció present en la memòria de traducció siga més imprecisa per ambigua (poden aparéixer correspondències múltiples entre les quals s'hauria d'elegir).
es_es: Pero si el fragmento es demasiado pequqeño es más probable que la traducción presente en la memoria de traducción sea más imprecisa por ambigua (pueden aparecer correspondencias múltiples entre las cuales se tendría que elegir).

source: En particular, l'aparició d'un punt (``.'') és moltes vegades un bon indicador del final d'una oració, però no sempre.
es_es: En particular, la aparición de un punto (``.'') es muchas veces un buen indicador del final de una oración, pero no siempre.

source: De fet, certs tipus de textos com ara documents tècnics, informes anuals o manuals d'instruccions, els quals se solen revisar freqüentment, sovint tenen moltes repeticions.
es_es: De hecho, ciertos tipos de textos como por ejemplo documentos técnicos, informes anuales o manuales de instrucciones, los cuales se suelen revisar frecuentemente, a menudo tienen muchas repeticiones.

source: En les seccions següents estudiarem dos aspectes importants que anomenarem codificació i format propiament dit.
es_es: En las secciones siguientes estudiaremos dos aspectos importantes que denominaremos codificación<\/y3> y formato<\/y4> propiamente dicho.

source: Tota la informació sobre TMX es troba en el servidor de LISA (Localisation Industry Standard Organization), un consorci d'empreses de localització (adaptació del programari a les llengües locals dels usuaris) per a la creació d'estàndards com ara el TMX.
es_es: Toda la información sobre TMX se encuentra en el servidor de LISA (Localisation Industry Standard Organization), un consorcio de empresas de localización (adaptación del software a las lenguas locales de los usuarios) para la creación de estándares como por ejemplo el TMX.

source: Aquesta codificació consta de dues fases: en la primera, s'assigna a cada caràcter un nombre enter positiu anomenat punt de codi o simplement codi; per exemple: ``a'' $$ 97; ``?'' $$ 63, etc.
es_es: Esta codificación consta de dos fases: en la primera, se asigna a cada carácter un número entero positivo llamado punto de código<\/y2> o simplemente código<\/y3>; por ejemplo: ``a<\/y5>'' $$ 97; ``?<\/y6>'' $$ 63, etc.

source: Una memòria de traducció és una base de dades en la qual cada fitxa (registre) conté una unitat de traducció, i té, per tant, com a mínim dos camps: el text esquerre i el text dret.
es_es: Una memoria de traducción es una base de datos en la cual cada ficha (registro) contiene una unidad de traducción, y tiene, por lo tanto, como mínimo dos campos: el texto izquierdo y el texto derecho.

source: Aquests fragments poden ser idèntics o similars.
es_es: Estos fragmentos pueden ser idénticos o similares.
